app/controllers/password_resets_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$04$hjh8lgrImAd6IXFdV3x0eesGVgdYPbC4R/cariMzdLG77a4lnXyS."], ["updated_at", 2016-10-19 00:51:24 UTC], ["id", 762146111]]
---
    def update
        if params[:user][:password].empty?                  # Case (3)
            @user.errors.add(:password, "can't be empty")
            render 'edit'
            elsif @user.update_attributes(user_params)          # Case (4)