app/controllers/users_controller.rb

 def create
     @user = User.new(user_params)
     if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "activation_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

 def database
     @users = User.all
---
SELECT "users".* FROM "users"